## Preprocessing

In [1]:
import os

os.getcwd()

'C:\\Users\\lenovo\\Desktop\\Digital Lync-Data Science'

In [2]:
import pandas as pd
from sklearn.preprocessing import Imputer

In [3]:
train = pd.read_csv(r'F:\Desktop\train.csv')
test = pd.read_csv(r'F:\Desktop\test.csv')

In [4]:
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [5]:
test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [6]:
print(train.shape, test.shape)

(891, 12) (418, 11)

In [7]:
print(train.isnull().sum(), test.isnull().sum())

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64 PassengerId      0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

In [8]:
"""Amongst 891 rows in train data, Cabin has 687 missing values(~70%) and test data Cabin has 327 Missing Values out of 418 values
So, we can drop Cabin column as follows"""

train = train.drop(['Cabin'], axis = 'columns')
test = test.drop(['Cabin'], axis = 'columns')

In [9]:
"""We can set PassengerID as index to train and test as follows"""

train = train.set_index('PassengerId')
test = test.set_index('PassengerId')

In [10]:
print(train.isnull().sum(), test.isnull().sum())

Survived      0
Pclass        0
Name          0
Sex           0
Age         177
SibSp         0
Parch         0
Ticket        0
Fare          0
Embarked      2
dtype: int64 Pclass       0
Name         0
Sex          0
Age         86
SibSp        0
Parch        0
Ticket       0
Fare         1
Embarked     0
dtype: int64

## From the above data we can swe the missing values.So, we can Impute them.

1. Train data--->>Age and Embarked contains missing values
2. Test data--->>>Age and Fare contains missing values.

3. So, we can Fill [Age] in train and [Age] and [Fare] in test with their median.
4.  But [Embarked] cannot be filled by median as it is a categorical variable.So it can be filled with its mode

In [11]:
mode = train['Embarked'].value_counts().index[0]
train['Embarked'] = train['Embarked'].fillna(mode)


#Imputation

median_imp = Imputer(missing_values = 'NaN', strategy = 'median', axis = 0, copy = False)

median_imp.fit_transform((train['Age']).values.reshape(-1, 1))
median_imp.fit_transform((test['Age']).values.reshape(-1, 1))
median_imp.fit_transform((test['Fare']).values.reshape(-1, 1))
print(train.isnull().sum(), test.isnull().sum())

Survived    0
Pclass      0
Name        0
Sex         0
Age         0
SibSp       0
Parch       0
Ticket      0
Fare        0
Embarked    0
dtype: int64 Pclass      0
Name        0
Sex         0
Age         0
SibSp       0
Parch       0
Ticket      0
Fare        0
Embarked    0
dtype: int64

In [12]:
train.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 891 entries, 1 to 891
Data columns (total 10 columns):
Survived    891 non-null int64
Pclass      891 non-null int64
Name        891 non-null object
Sex         891 non-null object
Age         891 non-null float64
SibSp       891 non-null int64
Parch       891 non-null int64
Ticket      891 non-null object
Fare        891 non-null float64
Embarked    891 non-null object
dtypes: float64(2), int64(4), object(4)
memory usage: 76.6+ KB

In [13]:
train1 = train.drop(['Name', 'Ticket'], axis = 'columns')
test1 = test.drop(['Name', 'Ticket'], axis = 'columns')

In [14]:
train1.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 891 entries, 1 to 891
Data columns (total 8 columns):
Survived    891 non-null int64
Pclass      891 non-null int64
Sex         891 non-null object
Age         891 non-null float64
SibSp       891 non-null int64
Parch       891 non-null int64
Fare        891 non-null float64
Embarked    891 non-null object
dtypes: float64(2), int64(4), object(2)
memory usage: 62.6+ KB

In [15]:
cat_cols = ['Survived', 'Pclass', 'Sex', 'Embarked']

for col in cat_cols:
    train1[col] = train[col].astype('category')
    if col == 'Survived':
        continue
    test1[col] = test[col].astype('category')

In [16]:
print(train1.info(), test.info())

<class 'pandas.core.frame.DataFrame'>
Int64Index: 891 entries, 1 to 891
Data columns (total 8 columns):
Survived    891 non-null category
Pclass      891 non-null category
Sex         891 non-null category
Age         891 non-null float64
SibSp       891 non-null int64
Parch       891 non-null int64
Fare        891 non-null float64
Embarked    891 non-null category
dtypes: category(4), float64(2), int64(2)
memory usage: 38.7 KB
<class 'pandas.core.frame.DataFrame'>
Int64Index: 418 entries, 892 to 1309
Data columns (total 9 columns):
Pclass      418 non-null int64
Name        418 non-null object
Sex         418 non-null object
Age         418 non-null float64
SibSp       418 non-null int64
Parch       418 non-null int64
Ticket      418 non-null object
Fare        418 non-null float64
Embarked    418 non-null object
dtypes: float64(2), int64(3), object(4)
memory usage: 32.7+ KB
None None

In [17]:
dum_cols = cat_cols[1:]

train1 = pd.get_dummies(train1, columns = dum_cols, prefix_sep='_', drop_first=True)
test1 = pd.get_dummies(test1, columns = dum_cols, prefix_sep='_', drop_first=True)

In [18]:
train1.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 891 entries, 1 to 891
Data columns (total 10 columns):
Survived      891 non-null category
Age           891 non-null float64
SibSp         891 non-null int64
Parch         891 non-null int64
Fare          891 non-null float64
Pclass_2      891 non-null uint8
Pclass_3      891 non-null uint8
Sex_male      891 non-null uint8
Embarked_Q    891 non-null uint8
Embarked_S    891 non-null uint8
dtypes: category(1), float64(2), int64(2), uint8(5)
memory usage: 40.1 KB

In [19]:
train1.shape

(891, 10)

In [20]:
train1.head()

,Survived,Age,SibSp,Parch,Fare,Pclass_2,Pclass_3,Sex_male,Embarked_Q,Embarked_S
PassengerId,,,,,,,,,,
1,0,22.0,1,0,7.2500,0,1,1,0,1
2,1,38.0,1,0,71.2833,0,0,0,0,0
3,1,26.0,0,0,7.9250,0,1,0,0,1
4,1,35.0,1,0,53.1000,0,0,0,0,1
5,0,35.0,0,0,8.0500,0,1,1,0,1

In [21]:
test1.head()

,Age,SibSp,Parch,Fare,Pclass_2,Pclass_3,Sex_male,Embarked_Q,Embarked_S
PassengerId,,,,,,,,,
892,34.5,0,0,7.8292,0,1,1,1,0
893,47.0,1,0,7.0000,0,1,0,0,1
894,62.0,0,0,9.6875,1,0,1,1,0
895,27.0,0,0,8.6625,0,1,1,0,1
896,22.0,1,1,12.2875,0,1,0,0,1

## Logistic Regression

In [66]:
from sklearn.linear_model import LogisticRegression
model = LogisticRegression(C = 1e4)
X = train1.drop(['Survived'], axis = 1, inplace = False)
Y = train1['Survived']
model.fit(X, Y)

LogisticRegression(C=10000.0, class_weight=None, dual=False,
          fit_intercept=True, intercept_scaling=1, max_iter=100,
          multi_class='ovr', n_jobs=1, penalty='l2', random_state=None,
          solver='liblinear', tol=0.0001, verbose=0, warm_start=False)

In [67]:
train_preds = model.predict(X)
test_preds = model.predict(test1)

### confusion matrix and classification report

In [68]:
from sklearn.metrics import classification_report
from sklearn.metrics import confusion_matrix

conf_mat = confusion_matrix(Y, train_preds) # Y->Actual survived, train_preds-> predicted
class_rep = classification_report(Y, train_preds)

print(conf_mat)
print(class_rep)

[[477  72]
 [102 240]]
             precision    recall  f1-score   support

          0       0.82      0.87      0.85       549
          1       0.77      0.70      0.73       342

avg / total       0.80      0.80      0.80       891

In [69]:
test1.index

Int64Index([ 892,  893,  894,  895,  896,  897,  898,  899,  900,  901,
            ...
            1300, 1301, 1302, 1303, 1304, 1305, 1306, 1307, 1308, 1309],
           dtype='int64', name='PassengerId', length=418)

In [70]:
file = pd.DataFrame(test_preds, index = test1.index, columns = ['Survived'])
file.head()

             Survived
PassengerId
892                 0
893                 0
894                 0
895                 0
896                 1

In [71]:
file.to_csv('file.csv', index = True)